Repository: Binancy/APP
Catalog: assets/langs/app_*.arb
Languages: ca, es

# add_income
source: Add an income
ca: Afegir ingrès
es: Añade un ingreso

# add_expend
source: Add an expend
ca: Afegir despesa
es: Añade un gasto

source: My account
ca: El meu compte
es: Mi cuenta

source: See categories
ca: Veure categories
es: Ver categorías

source: See all movements
ca: Tots els moviments
es: Todos mis movimientos

# microexpends
source: Quick expends
ca: Despeses ràpides
es: Gastos rápidos

source: Goals
ca: Objectius
es: Objetivos

source: My subscriptions
ca: Les meves subscripcions
es: Mis suscripciones

# help_advice
source: Help & Advices
ca: Ajudes i consells
es: Ayudas y consejos

source: Become premium
ca: Fes-te premium
es: Hazte premium

source: Settings
ca: Configuració
es: Ajustes

source: See heritage
ca: Veure patrimoni
es: Ver patrimonio

source: See incomes
ca: Veure ingressos
es: Ver ingresos

source: See expends
ca: Veure despeses
es: Ver gastos

source: See subscriptions
ca: Veure subscripcions
es: Ver suscripciones

source: My heritage
ca: El meu patrimoni
es: Mi patrimonio

# latests_movements
source: My latests movements
ca: Últims moviments
es: Mis últimos movimientos

# no_incomes
source: There's no incomes registered. Tap here for add.
ca: No hi ha cap ingrès registrat. Toca per afegir un
es: No hay ningún ingreso registrado. Toca para añadir uno.

# no_expends
source: There's no expends registered. Tap here for add.
ca: No hi ha cap despesa registrada. Toca per afegir una
es: No hay ningún gasto registrado. Toca para añadir uno.

# no_subscriptions
source: There's no subscriptions registered. Tap here for add.
ca: No hi ha cap subscripció registrada. Toca per afegir una
es: No hay ninguna suscripción registrada. Toca para añadir una.

# no_goals
source: There's no goals registered. Tap here for add.
ca: No hi ha cap objectiu registrat. Toca per afegir un
es: No hay ningún objetivo registrado. Toca para añadir uno.

source: My data
ca: Les meves dades
es: Mis datos

source: Name
ca: Nom
es: Nombre

source: Email
ca: Correu electrònic

source: Current plan
ca: Pla actual
es: Plan actual

# version
source: {appName}'s version
ca: Versió de {appName}
es: Versión de {appName}

source: My profile
ca: El meu perfil
es: Mi perfil

source: Notifications
ca: Notificacions
es: Notificaciones

source: Privacy policy
ca: Política de privacitat
es: Política de privacidad

# change_plan
source: Change your plan
ca: Canvia el teu pla
es: Cambiar de plan

source: Logout
ca: Tancar sessió
es: Cerrar sesión

source: Birthday
ca: Data de naixement
es: Fecha de nacimientos

# first_of_month
source: Payday
ca: Principi de mes
es: Principio de mes

# edit_profile
source: Edit my profile
ca: Edita el teu perfil
es: Editar perfil

# change_first_of_month
source: Change payday
ca: Canvia el teu principi de mes
es: Cambiar principio de mes

source: Change password
ca: Canvia la teva contrasenya
es: Cambiar contraseña

# delete_data
source: Delete your data
ca: Esborrar les teves dades
es: Borrar mis datos

# delete_account
source: Delete your account
ca: Elimina la teva compta
es: Eliminar mi cuenta

source: Current password
ca: Contrasenya actual
es: Contraseña actual

source: New password
ca: Nova contrasenya
es: Nueva contraseña

source: Repeat new password
ca: Repeteix la nova contrasenya
es: Repite tu nueva contraseña

# change_password_header
source: Change your password
ca: Canvia la teva contrasenya
es: Cambia tu contraseña

source: Your name
ca: El teu nom
es: Tu nombre

# your_first_surname
source: Your surname
ca: El teu primer cognom
es: Tu primer apellido

# your_last_surname
source: Your lastname
ca: El teu segon cognom
es: Tu segundo apellido

source: Update profile
ca: Actualitza el teu perfil
es: Actualizar perfil

# change_first_of_month_header
source: Select your payday
ca: Selecciona el teu principi de mes
es: Selecciona tu principio de mes

source: Change day
ca: Canviar dia
es: Cambiar día

source: Movement title
ca: Títol del moviment
es: Título del movimiento

source: Movement data
ca: Dades del moviment
es: Datos del movimiento

# movement_description
source: Add a description for this movement
ca: Afegeix una descripció a aquest moviment
es: Añade una descripción a este movimiento

# movement_date
source: Relization date
ca: Data de realització
es: Fecha de realización

# add_income_confirm
source: Add income
ca: Afegeix l'ingrès
es: Añadir ingreso

# add_expend_confirm
source: Add expend
ca: Afegeix la despesa
es: Añadir gasto

# income
source: Incomes
ca: Ingressos
es: Ingresos

# expend
source: Expends
ca: Despeses
es: Gastos

source: Incomes realized
ca: Ingressos realitzats
es: Ingresos realizados

# premium_action
source: This is a premium action
ca: Aquesta és una funció premium
es: Esta es una función premium

# premium_action_description
source: For use this function you must adquire one of the plans that {appName} offers
ca: Per a utilitzar aquesta funció has d'adquirir un dels plans premium que {appName} ofereix
es: Para utilizar esta función premium debes adquirir uno de los planes que {appName} ofrece

# logout_confirm
source: Are you sure you want to logout?
ca: Estàs segur que vols tancar la teva sessió?
es: ¿Está seguro que quieres cerrar tu sesión?

source: Cancel
ca: Cancel·lar
es: Cancelar

source: Accept
ca: Acceptar
es: Aceptar

# delete_data_description
source: Are you sure you want to delete all your data? Your account will continue to be able for {appName} and the rest of service that {organizationName} offers.
ca: Està segur que vols eliminar totes les teves dades? La teva compta seguirà estant activa per {appName} y els altres serveis que {organizationName} ofereix.
es: ¿Estás seguro que quieres eliminar todos tus datos? Tu cuenta seguirá estando activa para {appName} y los demás servicios que {organizationName} ofrece.

# delete_account_description
source: Are you sure you want to delete your account? If you delete your account also it will be deleted for the rest of services that {organizationName} offers. If you only want to delete your data from {appName} tap on "Only {appName}"
ca: Estàs segur que vols eliminar la teva compta? Si elimines la teva compta també s'eliminarà aquesta compta per als altres serveis que {organizationName} ofereix. Si només vols eliminar les teves dades de {appName} selecciona "Només {appName}"
es: ¿Estás seguro que quieres eliminar tu cuenta? Si eliminas tu cuenta también se eliminará esta cuenta para los demás servicios que {organizationName} ofrece. Si solamente quieres eliminar tus datos de {appName} selecciona "Solo {appName}"

source: Registered since
ca: Registrat desde
es: Registrado desde

source: Only {appName}
ca: Només {appName}
es: Solo {appName}

source: Your monthly balance
ca: El vostre saldo mensual
es: Tu balance mensual

# dashboard_actions_header
source: What do you want to do?
ca: Que vols fer?
es: ¿Que quieres hacer?

# dashboard_summary_widget_description
source: This month you've earned {totalIncomes}{currency} and expended {totalExpends}{currency}
ca: Aquest mes has ingressat {totalIncomes}{currency} i has gastat {totalExpends}{currency}
es: Este mes has ingresado {totalIncomes}{currency} y has gastado {totalExpends}{currency}

source: My summary
ca: El meu resum
es: Mi resumen

source: Actions
ca: Accions
es: Acciones

source: Support
ca: Suport
es: Soporte

# realization_date
source: Date of realization
ca: Data de realització
es: Fecha de realización

# select_category
source: Select a category
ca: Selecciona una categoría
es: Selecciona una categoría

# premium_ad_description
source: Unlock more graphics and options by purchasing a premium plan
ca: Desbloqueja més gràfics i opcions comprant un pla premium
es: Desbloquea más gráficos y opciones comprando un plan premium

# all_movements
source: All my movements
ca: Tots els movimients
es: Todos tus movimientos

source: Since forever
ca: Desde sempre
es: Desde siempre

source: Expends realized
ca: Despeses realitzades
es: Gastos realizados

# your_microexpends
source: My quick expends
ca: Les teves despeses ràpides
es: Tus gastos rápidos

# microexpends_ad_description
source: Here you can add expends that you perform frecuently and add it more quickly
ca: Aqui podràs afegir despeses que realitzis amb frequència y poder afegir-los mès ràpid.
es: Aquí podrás añadir los gastos que realices con frecuencia y añadirlos más rápidamente.

source: Subscriptions active
ca: Subscripcions actives
es: Suscripciones activas

# all_subscriptions
source: All my subscriptions
ca: Totes les subscripcions
es: Todas tus suscripciones

# add_subscription_header
source: Add a new subscription
ca: Afegeix una nova subscripció
es: Añade una nueva suscripción

source: Add subscription
ca: Afegir subscripció
es: Añadir suscripción

# subscription_title
source: Subscription's title
ca: Títol de la subscripció
es: Título de la suscripción

# subscription_amount
source: Subscription's amount
ca: Import de la subscripció
es: Importe de la suscripción

# subscription_day
source: Renewal day
ca: Dia de renovació
es: Día de renovación

# subscription_ignore_this_month
source: Do not renew this month
ca: No renovar aquest mes
es: No renovar este mes

# subscription_description
source: Add a description to this subscription
ca: Afegeix una descripció a aquesta subscripció
es: Añade una descripción a esta suscripción

source: Update subscription
ca: Actualizar subscripció
es: Actualizar suscripción

# exit_confirm
source: Are you sure you want leave?
ca: Esteu segur que voleu marxar?
es: ¿Estás seguro que quieres salir?

source: Abort
ca: Abortar
es: Abortar

# make_donation
source: Make a donation
ca: Fes una donació
es: Haz una donación

# goals_header
source: Add a new goal
ca: Afegeix un objetiu
es: Añade un objetivo

# goal_title
source: Goal's title
ca: Títol del objectiu
es: Título del objetivo

# goal_amount
source: Goal's amount
ca: Quantitat a estalviar
es: Cantidad a ahorrar

# goal_date
source: Limit date
ca: Data límit
es: Fecha límite

# goal_description
source: Add a description to this goal
ca: Afegeix una descripció a aquest objectiu
es: Añade una descripción a este objetivo

source: Add goal
ca: Afegir objectiu
es: Añadir objetivo

source: Update goal
ca: Actualizar objectiu
es: Actualizar objetivo

source: Update income
ca: Actualizar ingrès
es: Actualizar ingreso

source: Update expend
ca: Actualizar depessa
es: Actualizar gasto

# goals_ad_description
source: Create goals to achieve in a specific time
ca: Estableix objectius que complir en un temps determinat
es: Establece objetivos que cumplir en un tiempo objetivo

# unexpected_error
source: An unexpected error has occurred. Please try again later
ca: Ha hagut un error inesperat. Torna a provar-hi més tarde
es: Ha ocurrido un error inesperado, inténtalo de nuevo más tarde

# income_add_success
source: Income successfully added
ca: Ingrès afegit correctament!
es: ¡Ingreso añadido correctamente!

# income_add_fail
source: An error has ocurred adding the income, please try again later.
ca: Ha hagut un error a l'afegir l'ingrès
es: Ha ocurrido un error al añadir el ingreso

# income_update_success
source: Income successfully updated
ca: Ingrès actualizat correctament!
es: ¡Ingreso actualizado correctamente!

# income_update_fail
source: An error has ocurred adding the expend, please try again later.
ca: Ha hagut un error a l'actualizar l'ingrès
es: Ha ocurrido un error al actualizar el ingreso

# income_title
source: Title of the income
ca: Títol de l'ingrès
es: Título del ingreso

# income_value
source: Amount of the income
ca: Valor de l'ingrès
es: Importe del ingreso

# expend_title
source: Title of the expend
ca: Títol de la despessa
es: Título del gasto

# expend_value
source: Amount of the expend
ca: Valor de la despessa
es: Importe del gasto

# expend_add_success
source: Expend successfully added
ca: Despesa afegida correctament!
es: ¡Gasto añadido correctamente!

# expend_add_fail
source: An error has ocurred updating the income, please try again later.
ca: Ha hagut un error a l'afegir la despesa
es: Ha ocurrido un error al añadir el gasto

# expend_update_success
source: Expend successfully updated
ca: Despesa actualizada correctament!
es: ¡Gasto actualizado correctamente!

# expend_update_fail
source: An error has ocurred updating the expend, please try again later.
ca: Ha hagut un error a l'actualizar la despesa
es: Ha ocurrido un error al actualizar el gasto

# subscription_add_success
source: Subscription successfully added
ca: Subscripció afegida correctament!
es: ¡Suscripción añadida correctamente!

# subscription_add_fail
source: An error has ocurred adding the subscription, please try again later.
ca: Ha hagut un error a l'afegir la subscripció
es: Ha ocurrido un error al añadir la suscripción

# subscription_update_success
source: Subscription successfully updated
ca: Subscripció actualizada correctament!
es: ¡Suscripción actualizada correctamente!

# subscription_update_fail
source: An error has ocurred updating the subscription, please try again later.
ca: Ha hagut un error a l'actualizar la suscripció
es: Ha ocurrido un error al actualizar la suscripción

# goal_add_success
source: Goal successfully added
ca: Objectiu afegit correctament!
es: ¡Objetivo añadido correctamente!

# goal_add_fail
source: An error has ocurred adding the goal, please try again later.
ca: Ha hagut un error a l'afegir l'objectiu
es: Ha ocurrido un error al añadir el objetivo

# goal_update_success
source: Goal successfully updated
ca: Objectiu actualizat correctament!
es: ¡Objetivo actualizado correctamente!

# goal_update_fail
source: An error has ocurred updating the goal, please try again later.
ca: Ha hagut un error a l'actualizar l'objectiu
es: Ha ocurrido un error al actualizar el objetivo

# microexpend_add_success
source: Quick expend successfully added
ca: Despesa ràpida afegida correctament!
es: ¡Gasto rápido añadido correctamente!

# microexpend_add_fail
source: An error has ocurred adding the quick expend, please try again later.
ca: Ha hagut un error a l'afegir la despesa ràpida
es: Ha ocurrido un error al añadir el gasto rápido

# microexpend_update_success
source: Quck expend successfully updated
ca: Despesa ràpida actualizada correctament!
es: ¡Gasto rápido actualizado correctamente!

# microexpend_update_fail
source: An error has ocurred updating the quick expend, please try again later.
ca: Ha hagut un error a l'actualizar la despesa ràpida
es: Ha ocurrido un error al actualizar el gasto rápido

# please_wait
source: Loading, please wait...
ca: Si us plau, esperi...
es: Por favor, espera...

# forgot_password_1
source: Have you forgotten your password?
ca: Ha oblidat la teva contrasenya?
es: ¿Has olvidado tu contraseña?

# forgot_password_2
source: Restore it
ca: Recuperala
es: Recupérala

source: Login
ca: Iniciar sessió
es: Iniciar sesión

# register_button_header
source: Don't have an account yet?
ca: Encara no tens una compta?
es: ¿Todavía no tienes cuenta?

source: Register
ca: Registra't
es: Regístrate

source: Create your account
ca: Crea la teva compta
es: Crea tu cuenta

source: Continue register
ca: Continuar registre
es: Continuar registro

# login_button_header
source: Do you already have an account?
ca: Ja tens una compta?
es: ¿Ya tienes cuenta?

# register_data_needed
source: Missing data to be entered
ca: Falten dades per introduir
es: Faltan datos por introducir

# password_not_valid
source: The password entered is not valid.
ca: La contrasenya no es vàlida
es: La contraseña no es válida

# email_not_valid
source: The email entered is not valid
ca: El correu electrònic no es vàlid
es: El correo electrónico introducido no es válido

# register_privacy_terms_1
source: I have read and accept
ca: He llegit i accepto
es: He leído y acepto

# register_privacy_terms_2
source: the terms and conditions of {appName} and {organizationName}
ca: els termes i condicions de {appName} i {organizationName}
es: los términos y condiciones de {appName} y {organizationName}

# register_advice_1
source: {appName} allows you to classify your movements in categories and have a better control of it
ca: {appName} et pemet classificar els teus moviments en categories per a tindre un major control d'aquests
es: {appName} te permite clasificar tus movimientos en categorías para tener un mayor control sobre ellos.

# register_advice_2
source: {appName} stores all your movements so that nothing is escaped from you
ca: {appName} emmagatzena tots els teus moviments per a que no se t'escapi res
es: {appName} almacena todos tus movimientos para que no se te escape ninguno.

# register_advice_3
source: {appName} allows you to visualize your movements in different ways and and filters.
ca: {appName} et pemet visualitzar els teus moviments de múltiples formes i filtres
es: {appName} te permite visualizar tus movimientos de múltiples formas y filtros.

source: Password
ca: Contrasenya
es: Contraseña

source: Premium features
ca: Característiques premium
es: Características premium

# latests_balances
source: Your latests balances
ca: Els meus últims saldos
es: Tus últimos balances

# subscription
source: Subscriptions
ca: Subscripcions
es: Suscripciones

source: Your goals
ca: Els teus objectius
es: Tus objectivos

source: See less
ca: Veure menys
es: Ver menos

source: See more
ca: Veure més
es: Ver más

# payday_dialog_header
source: Select your renewal day
ca: Selecciona el dia de renovació
es: Selecciona el día de renovación

# subscription_invalid_day
source: The renewal day introduced is not valid or its empty
ca: El dia de renovació introduit no es vàlid o no hi ha
es: El día de renovación no es válido o está en blanco

# subscription_invalid_amount
source: The amount introduced is not valid or its empty
ca: El valor introduit no es vàlid o esta en blanc
es: El valor de la suscripción no es válido o está en blanco

# subscription_invalid_title
source: The subscription must have a title
ca: La subscripció ha de tenir un títol
es: La suscripción debe tener un título

# subscription_renew_description
source: If you enable this option, {appName} will not renew this subscription this month. This function is useful if the subscription is renewed the same day you create the subscription, but the first payment has already been made
ca: Si habilites aquesta opció {appName} no renovarà aquesta subscripció aquest mes. Aquesta funció és útil si la subscripció es renova el mateix dia que creguis la subscripció, però ja s'ha efectuat el primer cobrament
es: Si habilitas esta opción {appName} no renovará esta suscripción este mes. Esta función es util si la suscripción se renueva el mismo día que creas la suscripcíon, pero ya se ha efectuado el primer cobro

source: Subscription active
ca: Subscripció activa
es: Suscripción activa

# subscription_renew_next
source: Your next subscription to be renewed
ca: La teva pròxima subscripció a renovar
es: Tu próxima suscripción a renovar

source: Updating
ca: Actualitzant...
es: Actualizando

# update_success
source: Update successfully!
ca: Dades actualitzades
es: ¡Datos actualizados!

# update_fail
source: An error has ocurred updating your data
ca: No s'ha pogut actualitzar
es: Ha ocurrido un error al actualizar

# update_placeholder
source: Slide to update
ca: Llisca per actualitzar
es: Desliza para actualizar

# update_release
source: Release to update
ca: Solta per actualitzar
es: Suelta para actualizar

# goal_invalid_title
source: The title of the goal is not valid or its empty
ca: El títol de l'objectiu no es vàlid o està en blanc
es: El título del objetivo no es válido o está en blanco

# goal_invalid_amount
source: The amount of the goal is not valid or its empty
ca: La quantitar a estalviar de l'objectiu no es vàlid o està en blanc
es: El importe a ahorrar del objetivo no es válido o está en blanco

# no_data
source: There's no data
ca: No hi ha dades
es: No hay datos

# payday_change_success
source: Payday changed succesfully!
ca: Principi de mes actualitzat correctament
es: ¡Principio de mes actualizado correctamente!

# payday_change_fail
source: An error has ocurred updating your payday
ca: El títol de l'objectiu no es vàlid o està en blanc
es: Ha ocurrido un error al actualizar tu principio de mes

# profile_update_success
source: Your profile has been updated successfully!
ca: Perfil actualizat correctament!
es: ¡Perfil actualizado correctamente!

# profile_update_fail
source: An error has ocurred updating your profile
ca: Ha hagut un error al actualizar el teu perfil
es: Ha ocurrido un error al actualizar tu perfil

# profile_update_no_changes
source: There's not changes on your profile
ca: No hi han canvis al teu perfil
es: No hay cambios en tu perfil

# profile_invalid_name
source: The name introduced is not valid
ca: El nom introduït no es vàlid
es: El nombre introducido no es válido

# set_birthday
source: Set your birthday
ca: Introdueix la teva data de naixement
es: Introduce tu fecha de nacimiento

# password_not_match
source: Passwords do not match
ca: Les contrasenyes no son les mateixes
es: Las contraseñas no coinciden

# password_not_empty
source: Password must not be empty
ca: La contrasenya no pot estar en blanc
es: La contraseña no puede estar en blanco

# password_not_current_password
source: The password introduced is not your current password
ca: La contrasenya que has introduït no es la teva contrasenya actual
es: La contraseña que has introducido no es tu contraseña actual

# password_current_empty
source: You've to introduce your current password
ca: Has d'introduïr la teva contrasenya
es: Tienes que introducir tu contraseña actual

# movement_invalid_amount
source: The amount of the movement is not valid or it's empty
ca: El valor del moviment no es vàlid o està en blanc
es: El valor del movimiento no es válido o está en blanco

# movement_invalid_title
source: The title of the movement is not valid or it's empty
ca: El títol del moviment no es vàlid o està en blanc
es: El título del movimiento no es válido o está en blanco

# movement_invalid_date
source: The realization date of the movement is not valid or its empty
ca: La data de realització del moviment no es vàlid o està en blanc
es: La fecha de realización del movimiento no es válido o está en blanco

# register_steps
source: Step {currentStep} of {totalSteps}
ca: Pas {currentStep} de {totalSteps}
es: Paso {currentStep} de {totalSteps}

# register_invalid_terms
source: You've to accept the terms of {appName}
ca: Has d'aceptar els termes de {appName}
es: Tienes que aceptar los términos de {appName}

# password_requirements
source: Password must be at least 8 characters long, 1 uppercase, 1 lowercase, 1 number, and 1 special character
ca: La contrasenya ha de tenir com a mínim 8 caràcters de longitud, 1 majúscula, 1 minúscula, 1 número i 1 caràcter especial
es: La contraseña debe tener como mínimo 8 caracteres de longitud, 1 mayúscula, 1 minúscula, 1 número y 1 carácter especial

# login_error_password
source: The email or the password is not correct
ca: L'usuari o la contrasenya no es correcta
es: El correo o la contraseña no son correctos

# error_no_connection
source: You don't have Internet connection
ca: No tens connexió a Internet
es: No tienes conexión a Internet

# error_timeout
source: The maximum time to perform the action has expired
ca: S'ha esgotat els temps màxim per dur a terme l'acció
es: Se ha agotado el tiempo máximo para llevar a cabo la acción

# microexpend_header
source: Add a new quick expend
ca: Afegeix una despesa ràpida
es: Añade un gasto rápido

# microexpend_title
source: Title of the quick expend
ca: Títol de la despesa ràpida
es: Título del gasto rápido

# microexpend_amount
source: Amount of the quick expend
ca: Valor de la despesa ràpida
es: Importe del gasto rápido
