Repository: Binancy/APP
Catalog: assets/langs/app_*.arb
Languages: ca, es

# microexpend_description
source: Add a description to the quick expend
ca: Afegeix una descripció a aquesta despesa ràpida
es: Añade una descripción a este gasto rápido

# add_microexpend
source: Add quick expend
ca: Afegir despesa ràpida
es: Añadir gasto rápido

# update_microexpend
source: Update quick expend
ca: Actualitzar despesa ràpida
es: Actualizar gasto rápido

# microexpend_invalid_title
source: The title of the quick expend is not valid or it's empty
ca: El títol de la despesa ràpida no es vàlid o està en blanc
es: El título del gasto rápido no es válido o está en blanco

# microexpend_invalid_amount
source: The amount of the quick expend is not valid or it's empty
ca: El valor de la despesa ràpida no es vàlid o està en blanc
es: El importe del gasto rápido no es válido o está en blanco

# no_microexpends
source: There's no quick expends registered. Tap for add one
ca: No hi ha cap despesa ràpida registrada. Toca per afegir una
es: No hay ningún gasto rápido registrado. Toca para añadir uno.

source: Delete
ca: Eliminar
es: Eliminar

source: Edit
ca: Editar
es: Editar

# goal_delete_success
source: Goal deleted successfully!
ca: Objectiu eliminat correctament!
es: ¡Objetivo eliminado correctamente!

# goal_delete_error
source: An error has ocurred deleting the goal
ca: Ha hagut un error al eliminar l'objectiu
es: Ha ocurrido un error al eliminar el objetivo

source: Today
ca: Avui
es: Hoy

source: Tomorrow
ca: Demà
es: Mañana

# goal_due_date
source: {days} days remaining
ca: {days} días restantes
es: {days} dias restantes

# goal_overdue
source: Ended {days} days ago
ca: Va finalitzar fa {days} dies
es: Finalizó hace {days} días

# goal_amount_of_total
source: {currentAmount}{currency} of {totalAmount}{currency}
ca: {currentAmount}{currency} de {totalAmount}{currency}
es: {currentAmount}{currency} de {totalAmount}{currency}

# income_delete_success
source: Income deleted successfully!
ca: Ingrès eliminat correctament!
es: ¡Ingreso eliminado correctamente!

# income_delete_error
source: An error has ocurred deleting the income
ca: Ha hagut un error al eliminar l'ingrès
es: Ha ocurrido un error al eliminar el ingreso

# expend_delete_success
source: Expend deleted successfully!
ca: Despessa eliminat correctament!
es: ¡Gasto eliminado correctamente!

# expend_delete_error
source: An error has ocurred deleting the expend
ca: Ha hagut un error al eliminar la despessa
es: Ha ocurrido un error al eliminar el gasto

source: Add
ca: Afegir
es: Añadir

# microexpend_delete_success
source: Quick expend deleted successfully!
ca: Despessa ràpida eliminada correctament!
es: ¡Gasto rápido eliminado correctamente!

# microexpend_delete_error
source: An error has ocurred deleting the quick expend
ca: Ha hagut un error al eliminar la depessa ràpida
es: Ha ocurrido un error al eliminar el gasto rápido

# subscription_delete_success
source: Subscription deleted successfully
ca: Subscripció eliminada correctament!
es: ¡Suscrpción eliminada correctamente!

# subscription_delete_error
source: An error has ocurred deleting the subscription
ca: Ha hagut un error al eliminar la subscripció
es: Ha ocurrido un error al eliminar la suscripción

# category_subscription
source: Subscriptions
ca: Subscripcions

# category_vital_income
source: Vital Incomes
ca: Ingressos Vitals

# category_supplies
source: Supplyments
ca: Sumministres

# category_fashion_beauty
source: Fashion & Beauty
ca: Moda y Bellesa

# category_transport_travel
source: Transport & Travel
ca: Transport y Viatges

# category_subscription_desc
source: Gym, Online platforms, Usual payments
ca: Gimnàs, Plataformes online, Pagaments recurrents

# category_vital_income_desc
source: Rent, Payroll, Grants
ca: Alquilers, Nòmines, Pensions

# category_supplies_desc
source: Bills, Insurances, Contracts
ca: Facturaments, Segurs, Contractes

# category_fashion_beauty_desc
source: Clothing, Hairdresser, Fashion Stores
ca: Vestimenta, Peluqueries, Botigues de moda

# category_transport_travel_desc
source: Petrol, Public transport, Planes
ca: Benzina, Transport públic, Avions

# movement_singular
source: movement
ca: moviment

# movement_plural
source: movements
ca: moviments

source: Category
ca: Categoria

# category_predefined
source: Predefined categories
ca: Categories predefinides

# category_user
source: Your categories
ca: Les teves categories

# category_add
source: Add a new categoría
ca: Afegeix una categoria

# category_update
source: Update category
ca: Actualitza la categoria

# category_title
source: Title of the category
ca: Títol de la categoria

# category_description
source: Description of the category
ca: Descripció de la categoria

# pick_colour
source: Pick a colour
ca: Escull un color

# category_error_needs_title
source: You need to set a title to the category
ca: La categoria ha de tenir un títol

# category_add_success
source: Category added successfully!
ca: Categoria afegida correctament!

# category_add_error
source: An error has ocurred adding the category
ca: Ha hagut un error al afegir la categoria

# category_update_success
source: Category updated successfully!
ca: Categoria actualitzada correctament!

# category_update_error
source: An error has ocurred updating the category
ca: Ha hagut un error al actualizar la categoria

# category_delete_success
source: Category deleted successfully!
ca: Categoria eliminada correctament!

# category_delete_error
source: An error has ocurred deleting the category
ca: Ha hagut un error al actualizar la categoria

# category_advice_1
source: See all the movements from the last 90 days classified in categories
ca: Visualitza tots els moviments dels últims 90 dies classificats per categories

# category_advice_2
source: You can create your custom categories and classifiy your movements
ca: Pots crear les teves propies categories i classificar els teus moviments

# category_advice_3
source: A category can have incomes and expeses, for see the other type of movements tap on the "Switch" button
ca: Una categoria pot tenir ingressos y despesses, per veure l'altre tipus de moviment, clica al botó "Canvia"

# no_categories
source: There's no categories registered. Tap here for add.
ca: No hi ha cap categoria registrada. Toca per afegir una

# movements_without_category
source: Without category
ca: Senze categoritzar

# category_add_button
source: Add category
ca: Afegir categoria

source: See all categories
ca: Veure totes les categories
